In [1]:
import numpy as np
import os
import seaborn as sns
import scipy.stats as stats
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data
import warnings
warnings.filterwarnings("ignore")
import acquire as acq
import prepare as prep

Print first three rows

In [4]:
df_iris = data('iris')
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [7]:
df_iris.shape

(150, 5)

In [87]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [86]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [11]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [88]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [12]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357' 

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
csv_export_url

'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/export?format=csv&gid=341089357'

In [15]:
df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [18]:
df_google.shape

(891, 12)

In [90]:
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [91]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [33]:
df_google.describe().Age

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [35]:
df_google.describe().Fare

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [37]:
df_google.nunique().Survived

2

In [42]:
print(df_google.Survived.unique())

[0 1]

In [46]:
print(pd.unique(df_google['Survived']))

[0 1]

In [96]:
for col in df_google.columns:
    if df_google[col].dtype == 'object':
        print(f"{col} has {df_google[col].nunique()} unique values.")

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

In [57]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [51]:
df_excel = pd.read_excel("train.xlsx", sheet_name="train")
df_excel.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
df_excel_sample = df_excel.head(101)
df_excel_sample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [98]:
df_excel.shape[0]

891

In [74]:
for col in df_excel.columns:
    print(col)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [75]:
for i, col in enumerate(df_excel.columns):
    if i >= 5:
        break
    print(col)

PassengerId
Survived
Pclass
Name
Sex

In [97]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [77]:
for col in df_excel.columns:
    if df_excel[col].dtype == 'object':
        print(col)

Name
Sex
Ticket
Cabin
Embarked

In [99]:
df_excel.select_dtypes('object').columns.to_list()

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [100]:
df_excel.select_dtypes('object').head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [101]:
df_excel.select_dtypes(exclude='object').head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [103]:
df_excel[['Age', 'Fare']].describe().T

      count       mean        std   min      25%      50%   75%       max
Age   714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
Fare  891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [83]:
# Replace 'column_name' with the desired numeric column name
column_name = 'Age'

# Calculate the range
min_value = df_excel[column_name].min()
max_value = df_excel[column_name].max()
column_range = max_value - min_value

print(f"Range of {column_name}: {column_range} ({min_value}-{max_value})")

Range of Age: 79.58 (0.42-80.0)

In [84]:
# Replace 'column_name' with the desired numeric column name
column_name = 'Fare'

# Calculate the range
min_value = df_excel[column_name].min()
max_value = df_excel[column_name].max()
column_range = max_value - min_value

print(f"Range of {column_name}: {column_range} ({min_value}-{max_value})")

Range of Fare: 512.3292 (0.0-512.3292)

In [2]:
import env

In [124]:
def new_titanic_data(SQL_query):
    """
    This function will:
    - take in a SQL_query
    - create a connection_url to mySQL
    - return a df of the given query from the titanic_db
    """
    url = get_db_url('titanic_db')
    
    return pd.read_sql(SQL_query, url)

In [125]:
def get_titanic_data(SQL_query, directory, filename = 'titanic.csv'):
    """
    This function will:
    - Check local directory for csv file
        - return if exists
    - if csv doesn't exist:
        - creates df of sql query
        - writes df to csv
    - outputs titanic df
    """
    if os.path.exists(directory+filename): 
        df = pd.read_csv(filename)
        return df
    else:
        df = new_titanic_data(SQL_query)

        df.to_csv(filename)
        return df

In [3]:
titanic_query = "select * from passengers"
directory = os.getcwd()

In [3]:
titanic_df = acq.get_titanic_data(titanic_query, directory)

In [4]:
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [130]:
def new_iris_data(SQL_query):
    """
    This function will:
    - take in a SQL_query
    - create a connection_url to mySQL
    - return a df of the given query from the iris_db
    """
    url = get_db_url('iris_db')
    
    return pd.read_sql(SQL_query, url)

In [117]:
def get_iris_data(SQL_query, directory, filename = 'iris.csv'):
    """
    This function will:
    - Check local directory for csv file
        - return if exists
    - if csv doesn't exist:
        - creates df of sql query
        - writes df to csv
    - outputs iris df
    """
    if os.path.exists(directory+filename): 
        df = pd.read_csv(filename)
        return df
    else:
        df = new_iris_data(SQL_query)

        df.to_csv(filename)
        return df

In [8]:
iris_query = """
            SELECT 
                species_id,
                species_name,
                sepal_length,
                sepal_width,
                petal_length,
                petal_width
            FROM measurements
            JOIN species USING(species_id)            
"""

iris_df = acq.get_iris_data(iris_query, directory)
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [ ]:
def new_telco_data(SQL_query):
    """
    This function will:
    - take in a SQL_query
    - create a connection_url to mySQL
    - return a df of the given query from the telco_db
    """
    url = get_connection_url('telco_churn')
    
    return pd.read_sql(SQL_query, url)

In [ ]:
def get_telco_data(SQL_query, directory, filename = 'telco.csv'):
    """
    This function will:
    - Check local directory for csv file
        - return if exists
    - if csv doesn't exist:
        - creates df of sql query
        - writes df to csv
    - outputs telco df
    """
    if os.path.exists(directory+filename): 
        df = pd.read_csv(filename)
        return df
    else:
        df = new_telco_data(SQL_query)

        df.to_csv(filename)
        return df

In [5]:
telco_query = """
        select * from customers
        join contract_types using (contract_type_id)
        join internet_service_types using (internet_service_type_id)
        join payment_types using (payment_type_id)
        """

telco_df = acq.get_telco_data(telco_query, directory)
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

===================Data iris_db Prep====================

Use the function defined in acquire.py to load the iris data.

In [2]:
iris_query = """
            SELECT 
                species_id,
                species_name,
                sepal_length,
                sepal_width,
                petal_length,
                petal_width
            FROM measurements
            JOIN species USING(species_id)            
"""

iris_df = acq.get_iris_data(iris_query)
iris_df.head()

,Unnamed: 0,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,5.1,3.5,1.4,0.2
1,1,1,setosa,4.9,3.0,1.4,0.2
2,2,1,setosa,4.7,3.2,1.3,0.2
3,3,1,setosa,4.6,3.1,1.5,0.2
4,4,1,setosa,5.0,3.6,1.4,0.2

Drop the species_id and measurement_id columns.

In [4]:
iris_df = iris_df.drop(columns=['species_id'], axis=1)

In [5]:
iris_df.head(3)

,Unnamed: 0,species_name,sepal_length,sepal_width,petal_length,petal_width
0,0,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,2,setosa,4.7,3.2,1.3,0.2

Rename the species_name column to just species.

In [10]:
iris_df = iris_df.rename(columns = {'species_name': 'species'})

In [11]:
iris_df.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [12]:
iris_df.species.head()

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: species, dtype: object

In [13]:
pd.get_dummies(iris_df.species).head()

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0
3       1           0          0
4       1           0          0

In [14]:
pd.get_dummies(iris_df[['species']]).drop_duplicates()

     species_setosa  species_versicolor  species_virginica
0                 1                   0                  0
50                0                   1                  0
100               0                   0                  1

In [15]:
dummy_df = pd.get_dummies((iris_df.species), drop_first=True)
dummy_df.head(3)

   versicolor  virginica
0           0          0
1           0          0
2           0          0

In [16]:
iris_df = pd.concat([iris_df, dummy_df], axis=1)

In [23]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [11]:
def clean_iris(iris_df):
    
    iris_df = iris_df.drop(columns=['species_id'], axis=1)
    
    iris_df = iris_df.rename(columns = {'species_name': 'species'})
    
    dummy_df = pd.get_dummies((iris_df.species), drop_first=True)
    
    iris_df = pd.concat([iris_df, dummy_df], axis=1)
    return iris_df

In [7]:
fresh_iris_db = prep.get_iris_data(iris_query)

In [9]:
fresh_iris_db.head()

,Unnamed: 0,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,5.1,3.5,1.4,0.2
1,1,1,setosa,4.9,3.0,1.4,0.2
2,2,1,setosa,4.7,3.2,1.3,0.2
3,3,1,setosa,4.6,3.1,1.5,0.2
4,4,1,setosa,5.0,3.6,1.4,0.2

In [13]:
clean_iris(fresh_iris_db).head()

,Unnamed: 0,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,0,setosa,5.1,3.5,1.4,0.2,0,0
1,1,setosa,4.9,3.0,1.4,0.2,0,0
2,2,setosa,4.7,3.2,1.3,0.2,0,0
3,3,setosa,4.6,3.1,1.5,0.2,0,0
4,4,setosa,5.0,3.6,1.4,0.2,0,0

===================Data titanic_db Prep====================

In [2]:
titanic_query = "select * from passengers"
directory = os.getcwd()

In [3]:
titanic_df = acq.get_titanic_data(titanic_query)

In [4]:
titanic_df

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [5]:
titanic_df

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    891 non-null    int64
 1   passenger_id  891 non-null    int64
 2   survived      891 non-null    int64
 3   pclass        891 non-null    int64
 4   sex           891 non-null    object
 5   age           714 non-null    float64
 6   sibsp         891 non-null    int64
 7   parch         891 non-null    int64
 8   fare          891 non-null    float64
 9   embarked      889 non-null    object
 10  class         891 non-null    object
 11  deck          203 non-null    object
 12  embark_town   889 non-null    object
 13  alone         891 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 97.6+ KB

In [7]:
titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [8]:
titanic_df = titanic_df.drop("Unnamed: 0" ,axis=1)

In [9]:
titanic_df.passenger_id.duplicated().sum()

0

In [10]:
pd.crosstab(titanic_df.embark_town, titanic_df.embarked)

embarked       C   Q    S
embark_town
Cherbourg    168   0    0
Queenstown     0  77    0
Southampton    0   0  644

In [11]:
titanic_df = titanic_df.drop(columns='embark_town')

In [12]:
titanic_df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,1

In [13]:
#use get_dummies on sex data
pd.get_dummies(titanic_df.sex).head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [14]:
#drop first column
pd.get_dummies(titanic_df.sex, drop_first=True).head()

   male
0     1
1     0
2     0
3     0
4     1

In [15]:
# create dummy variables for 'embarked'
pd.get_dummies(titanic_df[['embarked']]).drop_duplicates()

    embarked_C  embarked_Q  embarked_S
0            0           0           1
1            1           0           0
5            0           1           0
61           0           0           0

In [16]:
# create dummy variables for 'sex' and 'embark_town'
dummy_df = pd.get_dummies(titanic_df[['sex', 'embarked']], drop_first=True)
dummy_df.head()

   sex_male  embarked_Q  embarked_S
0         1           0           1
1         0           0           0
2         0           0           1
3         0           0           1
4         1           0           1

In [17]:
titanic_df = pd.concat([titanic_df, dummy_df], axis=1)

In [18]:
titanic_df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,alone,sex_male,embarked_Q,embarked_S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,0,1,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,0,0,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,1,0,0,1

In [19]:
def prep_titanic(titanic_df):
    '''
    This function will clean the the titanic dataset
    '''
    titanic_df = titanic_df.drop("Unnamed: 0" ,axis=1)
    
    titanic_df = titanic_df.drop(columns =['embark_town','class','age','deck'])

    titanic_df.embarked = titanic_df.embarked.fillna(value='S')

    dummy_df = pd.get_dummies(titanic_df[['sex','embarked']], drop_first=True)
    titanic_df = pd.concat([titanic_df, dummy_df], axis=1)
    return titanic_df

In [20]:
fresh_df = acq.get_titanic_data(titanic_query)

In [21]:
fresh_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [22]:
prep_titanic(fresh_df)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
0,0,0,3,male,1,0,7.2500,S,0,1,0,1
1,1,1,1,female,1,0,71.2833,C,0,0,0,0
2,2,1,3,female,0,0,7.9250,S,1,0,0,1
3,3,1,1,female,1,0,53.1000,S,0,0,0,1
4,4,0,3,male,0,0,8.0500,S,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,S,1,1,0,1
887,887,1,1,female,0,0,30.0000,S,1,0,0,1
888,888,0,3,female,1,2,23.4500,S,0,0,0,1
889,889,1,1,male,0,0,30.0000,C,1,1,0,0
890,890,0,3,male,0,0,7.7500,Q,1,1,1,0

===================Data telco_db Prep====================

In [2]:
telco_query = """
        select * from customers
        join contract_types using (contract_type_id)
        join internet_service_types using (internet_service_type_id)
        join payment_types using (payment_type_id)
        """

telco_df = acq.get_telco_data(telco_query)
telco_df.head()

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [3]:
telco_df = acq.get_telco_data(telco_query)

In [4]:
telco_df

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.60,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.90,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.90,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.00,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.90,267.4,Yes,Month-to-month,Fiber optic,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,7038,2,1,2,9987-LUTYD,Female,0,No,No,13,...,Yes,No,No,No,55.15,742.9,No,One year,DSL,Mailed check
7039,7039,1,2,1,9992-RRAMN,Male,0,Yes,No,22,...,No,No,Yes,Yes,85.10,1873.7,Yes,Month-to-month,Fiber optic,Electronic check
7040,7040,2,1,1,9992-UJOEL,Male,0,No,No,2,...,No,No,No,Yes,50.30,92.75,No,Month-to-month,DSL,Mailed check
7041,7041,2,1,3,9993-LHIEB,Male,0,Yes,Yes,67,...,Yes,No,Yes,No,67.85,4627.65,No,Two year,DSL,Mailed check
7042,7042,1,1,3,9995-HOTOH,Male,0,Yes,Yes,63,...,No,Yes,Yes,No,59.00,3707.6,No,Two year,DSL,Electronic check

In [5]:
telco_df = telco_df.drop("Unnamed: 0" ,axis=1)

In [6]:
telco_df.head(10)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.60,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.90,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.90,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.00,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.90,267.4,Yes,Month-to-month,Fiber optic,Mailed check
5,4,1,1,0013-MHZWF,Female,0,No,Yes,9,Yes,...,Yes,Yes,Yes,Yes,69.40,571.45,No,Month-to-month,DSL,Credit card (automatic)
6,3,2,3,0013-SMEOE,Female,1,Yes,No,71,Yes,...,Yes,Yes,Yes,Yes,109.70,7904.25,No,Two year,Fiber optic,Bank transfer (automatic)
7,4,2,3,0014-BMAQU,Male,0,Yes,No,63,Yes,...,Yes,No,No,Yes,84.65,5377.8,No,Two year,Fiber optic,Credit card (automatic)
8,1,1,1,0015-UOCOJ,Female,1,No,No,7,Yes,...,No,No,No,Yes,48.20,340.35,No,Month-to-month,DSL,Electronic check
9,2,1,3,0016-QLJIS,Female,0,Yes,Yes,65,Yes,...,Yes,Yes,Yes,Yes,90.45,5957.9,No,Two year,DSL,Mailed check

In [7]:
telco_df.isnull().sum()

payment_type_id             0
internet_service_type_id    0
contract_type_id            0
customer_id                 0
gender                      0
senior_citizen              0
partner                     0
dependents                  0
tenure                      0
phone_service               0
multiple_lines              0
online_security             0
online_backup               0
device_protection           0
tech_support                0
streaming_tv                0
streaming_movies            0
paperless_billing           0
monthly_charges             0
total_charges               0
churn                       0
contract_type               0
internet_service_type       0
payment_type                0
dtype: int64

In [8]:
telco_df.customer_id.duplicated().sum()

0

In [9]:
telco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   contract_type_id          7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [10]:
telco_df.phone_service.value_counts()

Yes    6361
No      682
Name: phone_service, dtype: int64

In [11]:
telco_df.multiple_lines.value_counts()

No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64

In [12]:
telco_df.online_security.value_counts()

No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64

In [13]:
telco_df.online_backup.value_counts()

No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64

In [14]:
telco_df.device_protection.value_counts()

No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64

In [15]:
pd.get_dummies(telco_df.gender).head()

   Female  Male
0       1     0
1       0     1
2       0     1
3       0     1
4       1     0

In [16]:
pd.get_dummies(telco_df.gender, drop_first=True).head()

   Male
0     0
1     1
2     1
3     1
4     0

In [17]:
dummy_df = pd.get_dummies((telco_df.gender), drop_first=True)
dummy_df.head()

   Male
0     0
1     1
2     1
3     1
4     0

In [18]:
telco_df = pd.concat([telco_df, dummy_df], axis=1)

In [19]:
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type,Male
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check,0
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check,1
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check,1
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check,1
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check,0

In [20]:
def prep_telco(telco_df):
    '''
    This function will clean the the telco dataset
    '''
    telco_df = telco_df.drop("Unnamed: 0" ,axis=1)

    dummy_df = pd.get_dummies((telco_df.gender), drop_first=True)
    telco_df = pd.concat([telco_df, dummy_df], axis=1)
    return telco_df

In [21]:
fresh_df = acq.get_telco_data(telco_query)

In [22]:
fresh_df.head()

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [2]:
prep_telco(fresh_df)

NameError: name 'prep_telco' is not defined

In [7]:
from sklearn.model_selection import train_test_split

In [13]:
def split_data(df, stratify_col):
    '''
    Takes in two arguments the dataframe name and the ("name" - must be in string format) to stratify  and
    return train, validate, test subset dataframes will output train, validate, and test in that order
    '''
    train, test = train_test_split(df, #first split
                                   test_size=.2,
                                   random_state=123,
                                   stratify=df[stratify_col])
    train, validate = train_test_split(train, #second split
                                    test_size=.25,
                                    random_state=123,
                                    stratify=train[stratify_col])
    return train, validate, test

In [4]:
iris_df = prep.clean_iris(iris_df)

In [9]:
iris_df.head(3)

,Unnamed: 0,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,0,setosa,5.1,3.5,1.4,0.2,0,0
1,1,setosa,4.9,3.0,1.4,0.2,0,0
2,2,setosa,4.7,3.2,1.3,0.2,0,0

In [16]:
prep.split_data(iris_df, 'species')

(     Unnamed: 0     species  sepal_length  sepal_width  petal_length  \
 70           70  versicolor           5.9          3.2           4.8
 123         123   virginica           6.3          2.7           4.9
 87           87  versicolor           6.3          2.3           4.4
 3             3      setosa           4.6          3.1           1.5
 15           15      setosa           5.7          4.4           1.5
 53           53  versicolor           5.5          2.3           4.0
 20           20      setosa           5.4          3.4           1.7
 50           50  versicolor           7.0          3.2           4.7
 54           54  versicolor           6.5          2.8           4.6
 52           52  versicolor           6.9          3.1           4.9
 81           81  versicolor           5.5          2.4           3.7
 88           88  versicolor           5.6          3.0           4.1
 145         145   virginica           6.7          3.0           5.2
 130         130   virginica           7.4          2.8           6.1
 149         149   virginica           5.9          3.0           5.1
 85           85  versicolor           6.0          3.4           4.5
 6             6      setosa           4.6          3.4           1.4
 31           31      setosa           5.4          3.4           1.5
 4             4      setosa           5.0          3.6           1.4
 18           18      setosa           5.7          3.8           1.7
 92           92  versicolor           5.8          2.6           4.0
 74           74  versicolor           6.4          2.9           4.3
 139         139   virginica           6.9          3.1           5.4
 125         125   virginica           7.2          3.2           6.0
 133         133   virginica           6.3          2.8           5.1
 100         100   virginica           6.3          3.3           6.0
 84           84  versicolor           5.4          3.0           4.5
 36           36      setosa           5.5          3.5           1.3
 41           41      setosa           4.5          2.3           1.3
 91           91  versicolor           6.1          3.0           4.6
 108         108   virginica           6.7          2.5           5.8
 89           89  versicolor           5.5          2.5           4.0
 23           23      setosa           5.1          3.3           1.7
 35           35      setosa           5.0          3.2           1.2
 137         137   virginica           6.4          3.1           5.5
 129         129   virginica           7.2          3.0           5.8
 1             1      setosa           4.9          3.0           1.4
 16           16      setosa           5.4          3.9           1.3
 55           55  versicolor           5.7          2.8           4.5
 67           67  versicolor           5.8          2.7           4.1
 32           32      setosa           5.2          4.1           1.5
 94           94  versicolor           5.6          2.7           4.2
 48           48      setosa           5.3          3.7           1.5
 25           25      setosa           5.0          3.0           1.6
 12           12      setosa           4.8          3.0           1.4
 95           95  versicolor           5.7          3.0           4.2
 46           46      setosa           5.1          3.8           1.6
 43           43      setosa           5.0          3.5           1.6
 69           69  versicolor           5.6          2.5           3.9
 119         119   virginica           6.0          2.2           5.0
 107         107   virginica           7.3          2.9           6.3
 140         140   virginica           6.7          3.1           5.6
 114         114   virginica           5.8          2.8           5.1
 104         104   virginica           6.5          3.0           5.8
 61           61  versicolor           5.9          3.0           4.2
 26           26      setosa           5.0          3.4           1.6
 82           82  versicolor           5.8          2.7           3.9
 8             8      setosa           4.4          2.9           1.4
 24           24      setosa           4.8          3.4           1.9
 51           51  versicolor           6.4          3.2           4.5
 115         115   virginica           6.4          3.2           5.3
 132         132   virginica           6.4          2.8           5.6
 126         126   virginica           6.2          2.8           4.8
 128         128   virginica           6.4          2.8           5.6
 14           14      setosa           5.8          4.0           1.2
 40           40      setosa           5.0          3.5           1.3
 59           59  versicolor           5.2          2.7           3.9
 109         109   virginica           7.2          3.6           6.1
 57           57  versicolor           4.9          2.4           3.3
 79           79  versicolor           5.7          2.6           3.5
 103         103   virginica           6.3          2.9           5.6
 9             9      setosa           4.9          3.1           1.5
 7             7      setosa           5.0          3.4           1.5
 142         142   virginica           5.8          2.7           5.1
 112         112   virginica           6.8          3.0           5.5
 73           73  versicolor           6.1          2.8           4.7
 83           83  versicolor           6.0          2.7           5.1
 111         111   virginica           6.4          2.7           5.3
 120         120   virginica           6.9          3.2           5.7
 147         147   virginica           6.5          3.0           5.2
 131         131   virginica           7.9          3.8           6.4
 5             5      setosa           5.4          3.9           1.7
 58           58  versicolor           6.6          2.9           4.6
 118         118   virginica           7.7          2.6           6.9
 141         141   virginica           6.9          3.1           5.1
 11           11      setosa           4.8          3.4           1.6
 29           29      setosa           4.7          3.2           1.6
 96           96  versicolor           5.7          2.9           4.2
 44           44      setosa           5.1          3.8           1.9
 97           97  versicolor           6.2          2.9           4.3

      petal_width  versicolor  virginica
 70           1.8           1          0
 123          1.8           0          1
 87           1.3           1          0
 3            0.2           0          0
 15           0.4           0          0
 53           1.3           1          0
 20           0.2           0          0
 50           1.4           1          0
 54           1.5           1          0
 52           1.5           1          0
 81           1.0           1          0
 88           1.3           1          0
 145          2.3           0          1
 130          1.9           0          1
 149          1.8           0          1
 85           1.6           1          0
 6            0.3           0          0
 31           0.4           0          0
 4            0.2           0          0
 18           0.3           0          0
 92           1.2           1          0
 74           1.3           1          0
 139          2.1           0          1
 125          1.8           0          1
 133          1.5           0          1
 100          2.5           0          1
 84           1.5           1          0
 36           0.2           0          0
 41           0.3           0          0
 91           1.4           1          0
 108          1.8           0          1
 89           1.3           1          0
 23           0.5           0          0
 35           0.2           0          0
 137          1.8           0          1
 129          1.6           0          1
 1            0.2           0          0
 16           0.4           0          0
 55           1.3           1          0
 67           1.0           1          0
 32           0.1           0          0
 94           1.3           1          0
 48           0.2           0          0
 25           0.2           0          0
 12           0.1           0          0
 95           1.2           1          0
 46           0.2           0          0
 43           0.6           0          0
 69           1.1           1          0
 119          1.5           0          1
 107          1.8           0          1
 140          2.4           0          1
 114          2.4           0          1
 104          2.2           0          1
 61           1.5           1          0
 26           0.4           0          0
 82           1.2           1          0
 8            0.2           0          0
 24           0.2           0          0
 51           1.5           1          0
 115          2.3           0          1
 132          2.2           0          1
 126          1.8           0          1
 128          2.1           0          1
 14           0.2           0          0
 40           0.3           0          0
 59           1.4           1          0
 109          2.5           0          1
 57           1.0           1          0
 79           1.0           1          0
 103          1.8           0          1
 9            0.1           0          0
 7            0.2           0          0
 142          1.9           0          1
 112          2.1           0          1
 73           1.2           1          0
 83           1.6           1          0
 111          1.9           0          1
 120          2.3           0          1
 147          2.0           0          1
 131          2.0           0          1
 5            0.4           0          0
 58           1.3           1          0
 118          2.3           0          1
 141          2.3           0          1
 11           0.2           0          0
 29           0.2           0          0
 96           1.3           1          0
 44           0.4           0          0
 97           1.3           1          0  ,
      Unnamed: 0     species  sepal_length  sepal_width  petal_length  \
 124         124   virginica           6.7          3.3           5.7
 62           62  versicolor           6.0          2.2           4.0
 122         122   virginica           7.7          2.8           6.7
 98           98  versicolor           5.1          2.5           3.0
 64           64  versicolor           5.6          2.9           3.6
 60           60  versicolor           5.0          2.0           3.5
 136         136   virginica           6.3          3.4           5.6
 39           39      setosa           5.1          3.4           1.5
 27           27      setosa           5.2          3.5           1.5
 13           13      setosa           4.3          3.0           1.1
 99           99  versicolor           5.7          2.8           4.1
 90           90  versicolor           5.5          2.6           4.4
 121         121   virginica           5.6          2.8           4.9
 10           10      setosa           5.4          3.7           1.5
 47           47      setosa           4.6          3.2           1.4
 143         143   virginica           6.8          3.2           5.9
 21           21      setosa           5.1          3.7           1.5
 66           66  versicolor           5.6          3.0           4.5
 78           78  versicolor           6.0          2.9           4.5
 148         148   virginica           6.2          3.4           5.4
 113         113   virginica           5.7          2.5           5.0
 75           75  versicolor           6.6          3.0           4.4
 37           37      setosa           4.9          3.6           1.4
 49           49      setosa           5.0          3.3           1.4
 134         134   virginica           6.1          2.6           5.6
 106         106   virginica           4.9          2.5           4.5
 102         102   virginica           7.1          3.0           5.9
 71           71  versicolor           6.1          2.8           4.0
 30           30      setosa           4.8          3.1           1.6
 0             0      setosa           5.1          3.5           1.4

      petal_width  versicolor  virginica
 124          2.1           0          1
 62           1.0           1          0
 122          2.0           0          1
 98           1.1           1          0
 64           1.3           1          0
 60           1.0           1          0
 136          2.4           0          1
 39           0.2           0          0
 27           0.2           0          0
 13           0.1           0          0
 99           1.3           1          0
 90           1.2           1          0
 121          2.0           0          1
 10           0.2           0          0
 47           0.2           0          0
 143          2.3           0          1
 21           0.4           0          0
 66           1.5           1          0
 78           1.5           1          0
 148          2.3           0          1
 113          2.0           0          1
 75           1.4           1          0
 37           0.1           0          0
 49           0.2           0          0
 134          1.4           0          1
 106          1.7           0          1
 102          2.1           0          1
 71           1.3           1          0
 30           0.2           0          0
 0            0.2           0          0  ,
      Unnamed: 0     species  sepal_length  sepal_width  petal_length  \
 80           80  versicolor           5.5          2.4           3.8
 45           45      setosa           4.8          3.0           1.4
 144         144   virginica           6.7          3.3           5.7
 110         110   virginica           6.5          3.2           5.1
 38           38      setosa           4.4          3.0           1.3
 2             2      setosa           4.7          3.2           1.3
 135         135   virginica           7.7          3.0           6.1
 72           72  versicolor           6.3          2.5           4.9
 138         138   virginica           6.0          3.0           4.8
 34           34      setosa           4.9          3.1           1.5
 19           19      setosa           5.1          3.8           1.5
 77           77  versicolor           6.7          3.0           5.0
 101         101   virginica           5.8          2.7           5.1
 63           63  versicolor           6.1          2.9           4.7
 117         117   virginica           7.7          3.8           6.7
 76           76  versicolor           6.8          2.8           4.8
 42           42      setosa           4.4          3.2           1.3
 22           22      setosa           4.6          3.6           1.0
 28           28      setosa           5.2          3.4           1.4
 33           33      setosa           5.5          4.2           1.4
 17           17      setosa           5.1          3.5           1.4
 116         116   virginica           6.5          3.0           5.5
 127         127   virginica           6.1          3.0           4.9
 56           56  versicolor           6.3          3.3           4.7
 105         105   virginica           7.6          3.0           6.6
 146         146   virginica           6.3          2.5           5.0
 93           93  versicolor           5.0          2.3           3.3
 86           86  versicolor           6.7          3.1           4.7
 68           68  versicolor           6.2          2.2           4.5
 65           65  versicolor           6.7          3.1           4.4

      petal_width  versicolor  virginica
 80           1.1           1          0
 45           0.3           0          0
 144          2.5           0          1
 110          2.0           0          1
 38           0.2           0          0
 2            0.2           0          0
 135          2.3           0          1
 72           1.5           1          0
 138          1.8           0          1
 34           0.2           0          0
 19           0.3           0          0
 77           1.7           1          0
 101          1.9           0          1
 63           1.4           1          0
 117          2.2           0          1
 76           1.4           1          0
 42           0.2           0          0
 22           0.2           0          0
 28           0.2           0          0
 33           0.2           0          0
 17           0.3           0          0
 116          1.8           0          1
 127          1.8           0          1
 56           1.6           1          0
 105          2.1           0          1
 146          1.9           0          1
 93           1.0           1          0
 86           1.5           1          0
 68           1.5           1          0
 65           1.4           1          0  )